{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (Fall 2019, Winter 2020, Fall 2020, Winter 2021)"
      ],
      "degree": "Bachelor of Commerce (BComm),Major,Business Technology Management (BTM),Minor,Economics",
      "department": "Electrical and Computer Engineering",
      "duration": "2017-2021",
      "school_name": "Ryerson University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_JoelAttalla",
  "highlighted_projects": [
    {
      "description": "Developed and applied various IS solutions, diagrams, and models, using database, programming, security, and system designs to provide the client with their desired IS solutions to meet business needs.",
      "name": "ITM 90A/B Graduation Project"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a monitoring system with integrated bash scripts and SQL queries to extract, store, and analyze data and it?s processes across cluster nodes into a provisioned Postgres database.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_JoelAttalla/tree/master/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Began the learning process for the development of a proof of concept (PoC) system to analyze customer shopping behavior, to provide data analytics to enhance a company?s marketing strategies and decision making. ",
      "git_url": "",
      "name": "Python Data Analytics [Github(in progress)]"
    }
  ],
  "name": "Joel Attalla",
  "others": [
    {
      "bullets": [
        "Sports (Basketball, Hockey, Soccer)",
        "Trading/Investing",
        "Running/Hiking"
      ],
      "title": "Miscellaneous"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting",
      "description": "Learning and implementing various data engineering programs to attain the required experience for success in the workplace. Using Linux/SQL platforms, I have successfully developed a monitoring system with integrated bash scripts and SQL queries. Currently, I have begun the learning process for the development of a proof of concept (PoC) system using Python interphases.",
      "duration": "2021-Present",
      "title": "Junior Software Developer"
    },
    {
      "company": "Canada's Wonderland",
      "description": "Through my position as a rides supervision member at Canada?s Wonderland, consistent use of interpersonal skills with both park guests and employees is crucial. I am also responsible for maintaining team relations, done through regulating scheduling and training of all ride attendants and operators. In addition, I also conduct opening and closing procedures at ride locations, oversee the safe operations of the ride group, and resolve guest conflict.",
      "duration": "2019-Present",
      "title": "Rides Supervision Member"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "Javascript",
      "Statistics",
      "Finance",
      "Accounting"
    ],
    "familiar": [
      "Network Security",
      "Software Security",
      "Firewall Installation",
      "Data Encryption",
      "Web Development"
    ],
    "proficient": [
      "Data Analysis",
      "RDBMS/SQL",
      "Linux/Bash Script",
      "Git",
      "Docker",
      "Agile/Scrum",
      "Cloud Computing [Google Cloud Platform (GCP)]",
      "R",
      "HTML",
      "MS Office",
      "Excel"
    ]
  },
  "summary": "Recent BComm graduate with a major in Business Technology Management (BTM) and a minor in Economics from Ryerson University. My major integrated ICT-centered restructuring of core business principles, fostering a more innovative approach to these business strategies and, in turn, capitalizing on them. This involved a comprehensive study of core business disciplines and programming languages, such as SQL, Python, Javascript, R, and HTML. The four-year program concluded with a final project where I conducted a business case-study consisting of numerous business issues that the company wishes to resolve using ICT and business solutions. Over the year-long project, I was required to develop and apply various IS solutions, diagrams, and models. My team and I used database, programming, security, and system designs to provide the client with the desired IS solutions. My economics minor provided me with insight on quantitative economic analysis to implement for successful management decision making. With the background gained through my degree, coupled with the experience I have acquired with Jarvis Consulting, I anticipate learning more about various data engineering programs and techniques to expand my skills further and successfully secure a position as a Business Analyst/Business Systems Analyst/Data Analyst(BA/BSA/DA)."
}
